Tekla Open API Reference for Tekla Structures 2025
DrawingHandler.PrintDrawing Method (Drawing, DPMPrinterAttributes)
 Prints the drawing using the given printer attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool PrintDrawing(
	Drawing drawing,
	DPMPrinterAttributes printAttributes
)
Public Function PrintDrawing (
	drawing As Drawing,
	printAttributes As DPMPrinterAttributes
) As Boolean
Parameters
drawing
Type: Tekla.Structures.Drawing.Drawing
The drawing to be printed.
printAttributes
Type: Tekla.Structures.Drawing.DPMPrinterAttributes
The print attributes for the print job.
Return Value
Type: Boolean
True on success, false if printing fails.
Exceptions
Exception | Condition
ArgumentException | Thrown if PDF printing selected, but no file name provided.
See Also
Reference
DrawingHandler Class
PrintDrawing Overload
Tekla.Structures.Drawing Namespace